In [54]:
import os
import sys
module_path = os.path.abspath(os.path.join(os.pardir))
if module_path not in sys.path:
    sys.path.append(module_path)

import datetime
    
import pandas as pd

In [3]:
def create_df(csv):
    relative_filename = os.path.abspath(os.path.join(os.pardir, 'data', csv))
    df1 = pd.read_csv(relative_filename)

    return df1

In [4]:
item_cats = create_df('item_categories.csv')

In [64]:
sales_data = create_df('sales_train.csv')

In [6]:
items = create_df('items.csv')

In [7]:
shops = create_df('shops.csv')

In [65]:
sales_data.shape

(2935849, 6)

In [66]:
sales_data.columns

Index(['date', 'date_block_num', 'shop_id', 'item_id', 'item_price',
       'item_cnt_day'],
      dtype='object')

In [12]:
test_data = create_df('test.csv')

In [13]:
test_data

            ID  shop_id  item_id
0            0        5     5037
1            1        5     5320
2            2        5     5233
3            3        5     5232
4            4        5     5268
...        ...      ...      ...
214195  214195       45    18454
214196  214196       45    16188
214197  214197       45    15757
214198  214198       45    19648
214199  214199       45      969

[214200 rows x 3 columns]

In [67]:
sales_data['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [68]:
#reformat date column

sales_data['date']=sales_data['date'].apply(lambda x:datetime.datetime.strptime(x, '%d.%m.%Y'))

In [74]:
sales_data.groupby(["date_block_num", "shop_id","item_id"])['date', 'item_cnt_day']
.agg({'date':['min', 'max'],
      'item_cnt_day' : 'sum'})

                                     date            item_cnt_day
                                      min        max          sum
date_block_num shop_id item_id
0              0       32      2013-01-03 2013-01-31          6.0
                       33      2013-01-03 2013-01-28          3.0
                       35      2013-01-31 2013-01-31          1.0
                       43      2013-01-31 2013-01-31          1.0
                       51      2013-01-13 2013-01-31          2.0
...                                   ...        ...          ...
33             59      22087   2015-10-05 2015-10-23          6.0
                       22088   2015-10-03 2015-10-27          2.0
                       22091   2015-10-03 2015-10-03          1.0
                       22100   2015-10-18 2015-10-18          1.0
                       22102   2015-10-16 2015-10-16          1.0

[1609124 rows x 3 columns]